[
  {
    "id": "gita",
    "title": "Bhagavad Gita",
    "author": "Veda Vyasa",
    "introduction": "The Bhagavad Gita (Song of the Lord) is a 700-verse Hindu scripture that is part of the epic Mahabharata. It presents a dialogue between Prince Arjuna and his guide and charioteer, Lord Kṛsṇa.\n\nThe setting is the battlefield of Kuruksetra, just before the start of the great war between the Paṇḍavas and the Kauravas. Overwhelmed by moral dilemma and despair at the thought of fighting his own kinsmen, teachers, and friends, Arjuna refuses to fight.\n\nKṛsṇa then imparts transcendental knowledge, covering the principles of duty (Dharma), the nature of the soul (atman), devotion (Bhakti), action (Karma Yoga), and knowledge (Jñana Yoga). The 18 chapters of the Gita are often referred to as 18 Yogas (disciplines or paths to spiritual realization). The essence of the Gita is to encourage selfless action and devotion, regardless of worldly outcomes.",
    "path": "bhagavadGita.json",
    "coverImage": "images/KrishaArjuna.png"
  },
  {
    "id": "chalisa",
    "title": "Hanuman Chalisa",
    "author": "Tulsidas",
    "audioUrl": "https://archive.org/download/HanumanChalisaMSSubbulakshmiwww.Mp3MaD.Com/Hanuman_Chalisa-M_S_Subbulakshmi%5Bwww.Mp3MaD.Com%5D.mp3" ,
    "introduction": "The Hanuman Chalisa is a Hindu devotional hymn addressed to Lord Hanuman, a devout follower of Lord Rama and a central character in the epic Ramayana. Composed in the Awadhi language by the 16th-century poet Tulsidas, it is one of the most widely recited Hindu texts, revered for its power to invoke courage, strength, and protection.\n\nThe word 'Chalisa' derives from 'Chalis,' meaning forty in Hindi, referring to the 40 main verses (Chaupais) that form the core of the prayer. The complete recitation is traditionally counted as 43 sections, including two preliminary couplets (Dohas) that set the stage, and one final couplet that concludes the invocation.\n\nThe text glorifies Hanuman's immense strength, wisdom, celibacy, and unwavering devotion to Lord Rama. Reciting the Chalisa is believed to ward off evil spirits and negativity, alleviate suffering, and grant the devotee the virtues of knowledge and fortitude, making it a powerful spiritual anchor for millions of devotees worldwide.",
    "path": "hanumanChalisa.json",
    "coverImage": "images/HanumanChalisa.png"
  },
  {
    "id": "lalita",
    "title": "Lalita Sahasranama",
    "author": "Sage Hayagriva",
    "audioUrl": "https://music.youtube.com/watch?v=zgG-gjioU1g&si=LsihZ1X3i9Roem9h",
    "audioSource": "Ranjani-Gayatri - Youtube Music",
    "introduction": "The Lalita Sahasranama is one of the most sacred texts in Shaktism, dedicated to the Hindu Mother Goddess Lalita Tripurasundari, the form of the Divine Mother (Shakti) who governs the three worlds. This hymn appears in the Uttara Khanda of the Brahmanda Purana and is presented as a conversation between the sage Agastya and Lord Hayagriva (an incarnation of Vishnu).\n\nUnlike other Sahasranamas (thousand names) which may contain repetitive or manufactured names, the Lalita Sahasranama is unique because it is said to have been composed by the Goddess herself at the request of the Vagdevatas (Goddesses of Speech), ensuring its flawless and supreme nature.\n\nRecitation of the Sahasranama is central to the worship of Lalita and is believed to grant spiritual merit, prosperity, and liberation (moksha). The names systematically describe the Goddess's physical attributes, her divine weapons (like the sugarcane bow and flowery arrows), her glorious pastimes, and her role as the ultimate creator, maintainer, and destroyer of the universe.",
    "path": "lalitaSahasranama.json",
    "coverImage": "images/LalithaSahasranama.png"
  },
  {
    "id": "shiva",
    "title": "Shiva Tandava Stotram",
    "author": "Ravana",
    "audioUrl": "https://music.youtube.com/watch?v=qe_GFx6hGgw&si=YVzuwJgyjBb8rPRp",
    "audioSource": "Uma Mohan - Youtube Music",
    "introduction": "The Shiva Tandava Stotram is a Sanskrit hymn of praise to the Hindu God Shiva, often attributed to Ravana, the Rakshasa King of Lanka and a devoted follower of Shiva. The hymn is renowned for its intense, alliterative meter (Pañcacamara Jati), which mimics the powerful rhythm of Shiva's furious cosmic dance, the Tandava.\n\nComposed in a highly evocative and descriptive language, the stotram captures the duality of Shiva—the terrifying destroyer of ignorance and the benevolent bestower of blessings. It details his fierce appearance, including his matted locks holding the Ganga, the crescent moon on his head, the venomous serpents encircling his body, and the fire blazing on his forehead.\n\nRecitation of the Shiva Tandava Stotram is believed to bring immense courage, devotion, and freedom from fear.",
    "path": "shivaTandavaStotram.json",
    "coverImage": "images/ShivaTandav.png"
  },
  {
    "id": "vishnu-sahasranamam",
    "title": "Sri Vishnu Sahasranama Stotram",
    "author": "Sage Vyasa",
    "audioUrl": "https://archive.org/download/VishnuSahasranamam_MSS/Vishnu%20Sahasranamam.mp3",
    "audioSource": "MS Subbulakshmi - Archive.org",
    "introduction": "The Sri Vishnu Sahasranama Stotram (The Hymn of a Thousand Names of Vishnu) is one of the most sacred and revered hymns in Hinduism. It is a list of 1,000 names of Vishnu, one of the main deities in Hinduism and the Supreme Being in Vaishnavism. The most popular version of the Vishnu Sahasranama is found in the Anushasana Parva (Chapter 149) of the ancient Indian epic, the Mahabharata.\n\nThe hymn is traditionally attributed to Sage Vyasa, the legendary author of the Mahabharata. It originates in the context of the Kurukshetra war, where Yudhishthira, the eldest of the Pandavas, seeks spiritual guidance from Bhishma Pitamaha, who lies on a bed of arrows. Yudhishthira asks Bhishma: 'Who is the one supreme God in the world? Who is the one supreme refuge for all? By praising whom can humans attain auspiciousness? What is the greatest Dharma among all dharmas? By chanting what can a living being be freed from the bondage of samsara (cycle of birth and death)?'\n\nBhishma responds by reciting the thousand names of Lord Vishnu, extolling His divine qualities, attributes, and actions. Each name in the Sahasranama encapsulates a profound philosophical meaning, describing Vishnu's omnipresence, omnipotence, benevolence, and various cosmic roles. Chanting these names is believed to confer immense spiritual and material benefits, including peace of mind, freedom from fear, purification from sins, and ultimate liberation (moksha).",
    "path": "vishnu-sahasranamam.json",
    "coverImage": "images/VishnuSahasranama.png"
  },
  {
    "id": "soundarya-lahari",
    "introduction": "The Soundarya Lahari ('Waves of Beauty') is a famous Sanskrit literary work attributed to Adi Shankara. It is a devotional poem of one hundred verses (shlokas) praising Goddess Parvati as the supreme divine mother, depicted in various aspects of beauty, grace, and power. The first 41 verses are known as 'Ananda Lahari' (Waves of Bliss), focusing on the Kundalini yoga and the mystical aspects of the Sri Chakra. The remaining 59 verses are called 'Soundarya Lahari' (Waves of Beauty), describing the physical beauty of the Goddess from head to toe. It is a profound work that blends devotion, Tantric philosophy, and aesthetics, revered by devotees and scholars alike for its lyrical beauty and spiritual depth.",
    "title": "Soundarya Lahari",
    "author": "Adi Shankara",
    "audioUrl": "https://music.youtube.com/watch?v=i2VILavxQcQ&si=AQxi_jzwQP8NkR4r",
    "audioSource": "Bombay Sisters - Youtube Music",
    "introduction": "The Soundarya Lahari ('Waves of Beauty') is a famous Sanskrit literary work attributed to Adi Shankara. It is a devotional poem of one hundred verses (shlokas) praising Goddess Parvati as the supreme divine mother, depicted in various aspects of beauty, grace, and power. The first 41 verses are known as 'Ananda Lahari' (Waves of Bliss), focusing on the Kundalini yoga and the mystical aspects of the Sri Chakra. The remaining 59 verses are called 'Soundarya Lahari' (Waves of Beauty), describing the physical beauty of the Goddess from head to toe. It is a profound work that blends devotion, Tantric philosophy, and aesthetics, revered by devotees and scholars alike for its lyrical beauty and spiritual depth.",
    "path": "soundaryaLahiri.json",
    "coverImage": "images/soundaryaLahari.png"
  },
  {
    "id": "thiruPugazh",
    "title": "Thiruppugazh",
    "author": "Arunagirinathar",
    "introduction": "Thirupukazh, meaning 'Praise of the Lord,' is a masterpiece of devotional poetry in Tamil, consisting of hymns dedicated to Lord Murugan (Kartikeya). Composed by the saint-poet Arunagirinathar in the 15th century, the verses are renowned for their rhythmic complexity (Chandam) and profound spiritual content, focusing on the pursuit of spiritual liberation and the glory of Murugan's six abodes (Arupadaiveedu) and other sacred Sthalas (temples). The surviving collection contains approximately 1,307 songs.",
    "path": "thiruPugazh.json",
    "coverImage": "images/Murugan_by_Raja_Ravi_Varma.jpg"
  },
  {
    "id": "thiruppavai",
    "title": "Thiruppavai",
    "author": "Andal",
    "audioUrl":"https://archive.org/download/ThiruppavaiSaindhavi/Thiruppavai-Saindhavi.mp3",
    "audioSource": "Saindhavi - Archive.org",
    "introduction": "Thiruppavai is a collection of thirty verses (Pasurams) in Tamil written by Andal, one of the twelve Alvars. These verses are recited during the auspicious month of Markaḻi (mid-December to mid-January).\n\nThe text is structured as a 'Gopi Vratam,' a vow undertaken by the Gopis (cowherd girls) of Ayppaḍi (Gokulam). The ultimate goal is to awaken Lord Krishna and obtain his grace, which is represented by the 'Parai' (a divine reward/drum). The verses progress from invoking the rains, stating the rules of the vow, waking up fellow Gopis, waking up Krishna and his family, requesting boons, and concluding with the Phalashruti (the fruit of reading the text).",
    "path": "thiruPPavai.json",
    "coverImage": "images/thiruPPavai.png"
  },
  {
    "id": "aditya_hridayam",
    "title": "Aditya Hridayam",
    "author": "Agastya",
    "audioUrl": "https://music.youtube.com/watch?v=E1ILmUMovDw",
    "audioSource":"Rajalakshmi Sanjay - Youtube Music",
    "introduction": "Aditya Hrudayam (Sanskrit: आदित्यहृदयम्, romanized: adityahṛdayam) is a devotional hymn in praise of Surya, the Sun God, and is a significant stotra in Hinduism. It means 'The Heart of Aditya' (Aditya refers to Surya). This hymn was recited by the sage Agastya to Rama on the battlefield before his fight with Ravana, to bestow victory upon him. It is found in the Yuddha Kanda of the Valmiki Ramayana. Chanting this hymn is believed to bring courage, victory, prosperity, and good health. It comprises 31 verses that describe the Sun God's glory, His various names, and the benefits of His worship.",
    "path": "adityaHridayam.json",
    "coverImage": "images/adityaHridayam.png"
  },
  {
    "id": "ganapati-atharvashirsha",
    "title": "Ganapati Atharvashirsha",
    "author": "Vedic Tradition (Attributed to Atharvaveda)",
    "audioUrl": "https://archive.org/download/Ganapati_Atharvashirsha/ShriGaneshAtharvashirsha1.mp3",
    "audioSource": "Archive.org",
    "introduction": "The Ganapati Atharvashirsha (also known as the Ganapati Upanishad) is a Sanskrit text and a minor Upanishad of Hinduism, specifically associated with the Atharvaveda. It is a late Upanishadic text dedicated to **Lord Ganesha**, the deity of intellect, wisdom, and the remover of obstacles. The text elevates Ganesha to the status of **Brahman**, the Supreme Reality, asserting that he is the essence of all existence, the creator, sustainer, and destroyer of the universe. Chanting this hymn is considered highly meritorious, leading to spiritual fulfillment, success, and liberation (Moksha). The text is generally considered to have ten core verses (mantras) preceded by a Shanti Mantra (Peace Invocation) and followed by a PhalaSruti (statement of benefits).",
    "path": "GanapatiAtharvashirsha.json",
    "coverImage": "images/ganapatiAtharvashirsha.png"
  },
  {
    "id": "sri-rudram",
    "title": "Sri Rudram",
    "author": "Vedic Hymn (attributed to various Rishis)",
    "audioUrl": "https://music.youtube.com/watch?v=Nre6Qt7Fqv4&si=03d7RrlIqG9qliGP",
    "audioSource": "Challakere Brothers - Youtube Music",
    "introduction": "Sri Rudram is a Vedic hymn dedicated to Lord Rudra (Shiva). It consists of two parts: Namakam (11 anuvakas) praising Rudra in his many forms, and Chamakam (11 anuvakas) requesting blessings. Together they form 22 sections (~220 verses).",
    "path": "SriRudram.json",
    "coverImage": "images/sriRudram.png"
  },
  {
    "id": "rudrashtakam-tulsidas",
    "title": "Rudrashtakam",
    "author": "Goswami Tulsidas",
    "audioUrl": "https://music.youtube.com/watch?v=pI202yQMIXw&si=DSilm9RDTV0jerCX",
    "audioSource": "Dhvani Aurora - Youtube Music",
    "introduction": "The Rudrashtakam is a famous Sanskrit devotional hymn (stotra) composed by Goswami Tulsidas, the author of the Ramcharitmanas. It is dedicated to Lord Shiva, who is addressed here as Rudra. The hymn is known for its beautiful descriptions of Shiva's form and qualities, and is often recited to seek protection, purity of mind, and liberation. It consists of eight main verses (shlokas) and a concluding verse (phala shruti).",
    "path": "rudrashtakam.json",
    "coverImage": "images/rudrashtakam.png"
  },
  {
    "id": "sri-suktam",
    "title": "Sri Suktam",
    "author": "Vedic Sages (Khila Suktas of the Rigveda)",
    "introduction": "The Sri Suktam is a sacred Vedic hymn found in the Khila Suktas (appendices) of the Rigveda, dedicated to Goddess Sri (Laksmi), the personification of wealth, prosperity, and auspiciousness. It invokes the Goddess, often through the medium of Agni (the Fire God), to banish misfortune (Alaksmi) and bestow abundance in all its forms—material (gold, cattle, food) and spiritual (fame, peace, progeny). It is a key text in the veneration of the Divine Feminine.",
    "audioUrl": "https://archive.org/download/SriSuktam/SriSuktam.mp3",
    "audioSource": "Archive.org",
    "path": "sri-suktam.json",
    "coverImage": "images/sri-suktam.png"
  },
  {
    "id": "durga-suktam",
    "title": "Durga Suktam",
    "author": "Vedic Sages",
    "introduction": "The Durga Suktam is a Vedic hymn found in the *Mahanarayana Upanishad*. Although primarily addressed to Jatavedas Agni (the all-knowing Fire God), it is understood as an invocation of Goddess Durga, the Supreme Shakti who removes all obstacles (Durga literally meaning 'one who is difficult to approach or cross over'). The hymn prays for protection, prosperity, and the ability to cross over all difficulties in life, just as a boatman ferries people across a sea.",
    "audioUrl": "https://music.youtube.com/watch?v=2jOYhu85q70&si=MwMffSHSq1QEppzq",
    "audioSource": "Challakere Brothers - Youtube Music",
    "path": "durga-suktam.json",
    "coverImage": "images/durga-suktam.png"
  },
  {
    "id": "medha-suktam",
    "title": "Medha Suktam",
    "author": "Vedic Sages",
    "introduction": "The Medha Suktam is a hymn invoking the grace of Medha Devi, the personification of sharp intellect, memory, and wisdom. This Suktam is traditionally chanted by students and seekers of knowledge to improve their concentration, retention, and understanding. It appeals to various deities—including Agni, Indra, ASvins, and Sarasvati—to bestow the divine quality of Medha upon the worshipper.",    
    "audioUrl": "https://archive.org/download/MedhaSuktam/MedhaSuktam.mp3",
    "audioSource": "Archive.org",
    "path": "medha-suktam.json",
    "coverImage": "images/medha-suktam.png"
  },
  {
    "id": "lingashtakam",
    "title": "Lingastakam",
    "author": "Sri Adi Sankaracarya",
    "introduction": "The Lingastakam is a renowned devotional composition (Stotram) praising the Siva Lingam as the ultimate, formless reality (Brahman) and the source of the entire cosmos. Each of the eight verses highlights a specific quality of the Lingam—such as its sanctity, the materials used for its worship (sandal paste, flowers), its association with different deities, and its power to destroy the cycle of birth and death. Recitation of this hymn is believed to confer the highest state of bliss and salvation.",
    "audioUrl": "https://music.youtube.com/watch?v=ucJuXd-Wgcg&si=bRQnlcMe0G1KVxKj",
    "audioSource": "SP Balasubramanam - Youtube Music",
    "path": "lingashtakam.json",
    "coverImage": "images/lingashtakam.png"
  },
  {
    "id": "venkateswara-suprabhatam",
    "title": "Sri Venkatesvara Suprabhatam",
    "author": "Prativadibhayankara Annangacharya",
    "introduction": "The Venkatesvara Suprabhatam is the first of a set of four hymns dedicated to Lord Venkatesvara of Tirumala. This primary section, consisting of 29 verses, is a devotional call to the Lord to wake up from His yoga-nidra (yogic sleep). It praises His divine form, His glorious attributes, His consort Padmavati/Laksmi, and the auspicious signs of the morning, inviting Him to bless the world. The recitation is a mandatory part of the early morning rituals (Seva) at the Tirumala temple.",
    "audioUrl": "https://archive.org/download/VenkateshwaraSuprabhatam/vsuprabhatammss.mp3",
    "audioSource": "M S Subbulakshmi - Archive.org",
    "path": "venkateswara-suprabhatam.json",
    "coverImage": "images/venkateswara-suprabhatam.png"
  },
  {
    "id": "skanda-sashti-kavacham",
    "title": "Skanda Sashti Kavacham",
    "author": "Devaraya Swamigaḷ",
    "introduction": "The Skanda Sashti Kavacham is one of the most popular protective hymns in Tamil literature, devoted to Lord Murugan, also known as Skanda, Karttikeya, or Subramanya. Composed in a rhythmic poetic style, the hymn invokes the Lord (in His various forms and associated locations like Pazhani, Thiruthani, Swamimalai, etc.) to protect every part of the devotee's body, acting as a divine armor against all harm, poisons, evil spirits, and diseases.",
    "audioUrl": "https://archive.org/download/skandha-sashti-kavacham-and-sri-skandha-guru-kavacham/Skandha%20Sashti%20Kavacham%20and%20Sri%20Skandha%20Guru%20Kavacham/01-Skandha%20Sashti%20Kavasam.mp3",
    "audioSource": "Archive.org",
    "path": "skanda-sashti-kavacham.json",
    "coverImage": "images/skanda-sashti-kavacham.png"
  },
  {
    "id": "kanakadhara-stotram",
    "title": "Kanakadhara Stotram",
    "author": "Adi Sankaracarya",
    "language": "Sanskrit",
    "total_verses": 21,
    "introduction": "The Kanakadhara Stotram is a sacred Hindu hymn composed by Adi Sankaracarya in praise of Goddess Mahalakshmi. It is said that Sankaracarya composed this immediately when he witnessed the extreme poverty of an old woman and prayed to the Goddess. Upon hearing the spontaneous hymn, Goddess Lakshmi showered the woman's home with golden gooseberries (amalaka), creating the 'Stream of Gold' (Kanakadhara). The Stotram is a powerful prayer for material and spiritual prosperity.",
    "audioUrl": "https://archive.org/download/LalitaLakshmiDurgaDeviListenOnFriday/6-FRIDAY-LALITA-LAKSHMI-DURGA/10-KANAKA%20DHARA%20STOTRAM%20-%20BALA%20MURALI.MP3",
    "audioSource": "Bala Murali - Archive.org",
    "path": "kanakadhara-stotram.json",
    "coverImage": "images/kanakadhara-stotram.png"
  },
  {
    "id": "ganesha-pancharatnam",
    "title": "Ganesha Pancharatnam Stotram",
    "author": "Ādi Śaṅkarācārya",
    "introduction": "The Ganesha Pancharatnam is a highly revered devotional hymn composed by the great philosopher and saint, Ādi Śaṅkarācārya, in praise of Lord Gaṇeśa (Vināyaka). This short, powerful stotram consists of five main verses (Pañcaratna, or five jewels) and a concluding verse (Phalaśruti). It beautifully encapsulates the form, attributes, and protective power of Gaṇeśa, the remover of obstacles, and is chanted daily by devotees to invoke success, prosperity, and spiritual realization.",
    "total_verses": 6,
    "audioUrl": "https://music.youtube.com/watch?v=KZJUo7D6yNs&si=dLzrUSrNuAa6moG7",
    "audioSource": "MS Subbulakshmi and Radha Viswanathan - Youtube Music",
    "path": "ganesha-pancharatnam.json",
    "coverImage": "images/ganesha-pancharatnam.png"
  },
  {
    "id": "mahishasura-mardini",
    "title": "Mahishasura Mardini Stotram",
    "author": "Ādi Śaṅkarācārya (Traditional Attribution)",
    "introduction": "The Mahishasura Mardini Stotram is a vibrant and powerful devotional hymn dedicated to Goddess Durgā, the destroyer of the buffalo-demon Mahiṣāsura. Composed in the style of a Garland of Praise, this stotram highlights the Goddess's fierce yet compassionate nature, her divine attributes, and her role as the supreme protectress of the cosmos. The verses are deeply rhythmic and are often chanted during the Navarātri festival to invoke the Goddess's blessings for victory over evil and obstacles.",
    "total_verses": 22,
    "audioUrl": "https://music.youtube.com/watch?v=442ewPgXHQ0&si=LsvBwXklRL0I8tGA",
    "audioSource": "Rajalakshmee Sanjay - Youtube Music",
    "path": "mahishasura-mardini.json",
    "coverImage": "images/mahishasura-mardini.png"
  },
  {
    "id": "narasimha-kavacham",
    "title": "Narasimha Kavacham",
    "author": "Prahlāda Mahārāja (as told in the Brahmāṇḍa Purāṇa)",
    "introduction": "The Narasimha Kavacham (Armor of Narasimha) is a powerful protective hymn dedicated to Lord Narasimha, the man-lion avatar of Viṣṇu. Attributed to the great devotee Prahlāda Mahārāja, who was saved by the Lord from his demonic father, Hiraṇyakaśipu, this stotram is a detailed prayer invoking different aspects and limbs of Narasimha to act as a shield for every part of the reciter's body, mind, and spirit. It is widely revered for its ability to grant fearlessness, destroy evil, and bestow complete protection from all forms of danger, seen and unseen.",
    "total_verses": 32,
    "audioUrl": "https://music.youtube.com/watch?v=aai1k4SX_uk&si=xnrsmexcFpzvvpYc",
    "audioSource": "ISKCON Bangalore - Youtube Music",
    "path": "narasimha-kavacham.json",
    "coverImage": "images/narasimha.jpg"
  },
  {
    "id": "bhajans",
    "title": "Devotional",
    "author": "Various Artists",
    "path": "devotional.json",
    "coverImage": "images/bhajans.png",
    "showLast": "Yes"
  }
]
